tap "derailed/k9s"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "nicoverbruggen/cask"
tap "shivammathur/php"
brew "bash"
brew "curl"
brew "php"
brew "composer"
brew "coreutils"
brew "docker-compose"
brew "ffmpeg"
brew "git"
brew "grep"
brew "htop"
brew "python@3.11"
brew "httpie"
brew "jq"
brew "kubernetes-cli"
brew "mas"
brew "mysql"
brew "node"
brew "php@8.1"
brew "pkg-config"
brew "pv"
brew "python@3.10"
brew "python@3.9"
brew "tree"
brew "wget"
brew "yarn"
brew "zsh"
brew "derailed/k9s/k9s"
brew "shivammathur/php/php@5.6"
brew "shivammathur/php/php@7.4"
cask "devutils"
cask "docker"
cask "eul"
cask "font-fira-code"
cask "font-ibm-plex"
cask "hyper"
cask "mysqlworkbench"
cask "phpstorm"
cask "postman"
cask "raycast"
cask "rocket"
cask "scroll-reverser"
cask "spotify"
cask "sublime-text"
cask "telegram-desktop"
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "Hidden Bar", id: 1452453066
mas "Jiffy", id: 1502527999
mas "Today", id: 6443714928
mas "Velja", id: 1607635845
