# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'homebrew/cask-fonts'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'pkg-config'
brew 'wget'
brew 'mas' # Mac App Store manager
brew 'tree' # List directories in a tree structure

# Development
brew 'php'
brew 'php@7.4'
brew 'php@8.1'
brew 'composer'
brew 'mysql'
brew 'node'
brew 'yarn'
brew 'npm'
brew 'pv'
brew 'derailed/k9s/k9s'
brew 'devutils'
brew 'phpmon'
brew 'postman'

# Apps
cask 'docker'
cask 'google-chrome'
cask 'phpstorm'
cask 'telegram-desktop'
cask 'raycast'
cask 'spotify'
cask 'hyper'
cask 'mysqlworkbench'
cask 'rocket'
cask 'scroll-reverser'
cask 'sublime-text'
cask 'eul'
cask 'orion'

# Fonts
cask 'font-fira-code'
cask 'font-ibm-plex'

# Mac App Store
mas 'Amphetamine', id: 937984704
mas 'Velja', id: 1607635845
mas 'Jiffy', id: 1502527999
mas 'Bitwarden', id: 1352778147
mas 'Hidden Bar', id: 1452453066
mas 'Today', id: 6443714928

brew services start mysql
